# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge on One-to-Many and Many-to-many relationships!

## Objectives

You will be able to:
- Query data including Many-to-Many relationships
- Write queries that make use of Join Tables

## One-to-Many and Many-to-Many Joins
<img src='Database-Schema.png' width=550>

In [3]:
import sqlite3
import pandas as pd

In [4]:
conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cur = conn.cursor()

## Employees and their Office (a One-to-One join)

Return a list of all of the employees with their first name, last name and the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [36]:
#Your code here
query = """
select
    e.firstName
    ,e.lastName
    ,o.city
    ,o.state
from
    employees e 
    join offices o on e.officeCode = o.officeCode
order by 
    1,2
;
"""

## Customers and their Orders (a One-to-Many join)

Return a list of all of the customers. For each customer return a record for each of their order numbers, order dates and statuses.

In [40]:
# Your code here
result = cur.execute(query)

In [41]:
result.description

(('firstName', None, None, None, None, None, None),
 ('lastName', None, None, None, None, None, None),
 ('city', None, None, None, None, None, None),
 ('state', None, None, None, None, None, None))

In [42]:
#next(result)

In [43]:
#next(result)

In [44]:
list_result = list(result)
list_result

[('Andy', 'Fixter', 'Sydney', ''),
 ('Anthony', 'Bow', 'San Francisco', 'CA'),
 ('Barry', 'Jones', 'London', ''),
 ('Diane', 'Murphy', 'San Francisco', 'CA'),
 ('Foon Yue', 'Tseng', 'NYC', 'NY'),
 ('George', 'Vanauf', 'NYC', 'NY'),
 ('Gerard', 'Bondur', 'Paris', ''),
 ('Gerard', 'Hernandez', 'Paris', ''),
 ('Jeff', 'Firrelli', 'San Francisco', 'CA'),
 ('Julie', 'Firrelli', 'Boston', 'MA'),
 ('Larry', 'Bott', 'London', ''),
 ('Leslie', 'Jennings', 'San Francisco', 'CA'),
 ('Leslie', 'Thompson', 'San Francisco', 'CA'),
 ('Loui', 'Bondur', 'Paris', ''),
 ('Mami', 'Nishi', 'Tokyo', 'Chiyoda-Ku'),
 ('Martin', 'Gerard', 'Paris', ''),
 ('Mary', 'Patterson', 'San Francisco', 'CA'),
 ('Pamela', 'Castillo', 'Paris', ''),
 ('Peter', 'Marsh', 'Sydney', ''),
 ('Steve', 'Patterson', 'Boston', 'MA'),
 ('Tom', 'King', 'Sydney', ''),
 ('William', 'Patterson', 'Sydney', ''),
 ('Yoshimi', 'Kato', 'Tokyo', 'Chiyoda-Ku')]

>**BUT** remember that `next` is a **generator**, so when we casted it to a **list**, we had already "`pop`"ed 2 rows out!

Let's look at the columns

In [45]:
result.description

(('firstName', None, None, None, None, None, None),
 ('lastName', None, None, None, None, None, None),
 ('city', None, None, None, None, None, None),
 ('state', None, None, None, None, None, None))

Let's get the columns into a list:

In [46]:
cols = [row[0] for row in result.description]

Let's get into a dataframe

In [47]:
result_df = pd.DataFrame(list_result, columns = cols)
result_df.head()

  firstName lastName           city state
0      Andy   Fixter         Sydney
1   Anthony      Bow  San Francisco    CA
2     Barry    Jones         London
3     Diane   Murphy  San Francisco    CA
4  Foon Yue    Tseng            NYC    NY

In [34]:
result_df.head()

  firstName   lastName           city state
0      Jeff   Firrelli  San Francisco    CA
1   William  Patterson         Sydney
2    Gerard     Bondur          Paris
3   Anthony        Bow  San Francisco    CA
4    Leslie   Jennings  San Francisco    CA

## Aside: Py 3 Range - Generator

In [48]:
def py3_range(start,stop):
    """Yield each integer between start and stop."""
    i = start
    while i < stop:
        yield i
        i += 1

In [62]:
rng = py3_range(0,2)

In [65]:
next(rng)

StopIteration:

## Orders and their Order Details (another One-to-Many join)

Return a list of orders. For each order return a record for each order detail within the order.

In [70]:
# Your code here
query_2 = """
select
    o.*
    ,od.*
from
    orders o
    inner join orderdetails od on o.orderNumber = od.orderNumber
order by 
    o.orderNumber
    ,od.orderLineNumber
;
"""

In [71]:
order_result = cur.execute(query_2);

In [73]:
orders_df = pd.DataFrame(list(order_result))

In [75]:
orders_df.head()

,0,1,2,3,4,5,6,7,8,9,10,11
0,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,,363,10100,S24_3969,49,35.29,1
1,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,,363,10100,S18_2248,50,55.09,2
2,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,,363,10100,S18_1749,30,136.00,3
3,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,,363,10100,S18_4409,22,75.46,4
4,10101,2003-01-09,2003-01-18,2003-01-11,Shipped,Check on availability.,128,10101,S18_2795,26,167.06,1

In [76]:
orders_df.columns = [row[0] for row in order_result.description]

In [77]:
orders_df.head()

,orderNumber,orderDate,requiredDate,shippedDate,status,comments,customerNumber,orderNumber,productCode,quantityOrdered,priceEach,orderLineNumber
0,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,,363,10100,S24_3969,49,35.29,1
1,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,,363,10100,S18_2248,50,55.09,2
2,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,,363,10100,S18_1749,30,136.00,3
3,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,,363,10100,S18_4409,22,75.46,4
4,10101,2003-01-09,2003-01-18,2003-01-11,Shipped,Check on availability.,128,10101,S18_2795,26,167.06,1

## Orders, Order details and Product Details (a Many-to-Many Join)

Return a list of the orders with the the order information, and all the product information for each product in the order.

# You are here!

In [4]:
# Your code here
query_3 = """
select

from
    orders o
    inner join orderdetails od on o.orderNumber = od.orderNumber
    inner join products p on p.productCode = od.productCode

"""

## Summary

In this lab, you practiced your knowledge on One-to-Many and Many-to-many relationships!